tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    WaterPulseTraceFileStats savedStats{};
    const bool savedReady = ensureSavedPulseTracesReady();
    char savedCount[32]{};
    char savedSpace[48]{};
    std::snprintf(savedCount, sizeof(savedCount), "-");
    std::snprintf(savedSpace, sizeof(savedSpace), "-");
    if (savedReady) {
        savedStats = g_context.savedPulseTraces->stats();
        char savedUsed[24]{};
        char savedMax[24]{};
        std::snprintf(savedCount,
                      sizeof(savedCount),
                      "%lu / %lu 条",
                      static_cast<unsigned long>(savedStats.savedCount),
                      static_cast<unsigned long>(savedStats.maxCount));
        formatKb(savedStats.usedBytes, savedUsed, sizeof(savedUsed));
        formatKb(savedStats.maxBytes, savedMax, sizeof(savedMax));
        std::snprintf(savedSpace, sizeof(savedSpace), "%s / %s", savedUsed, savedMax);
    }
    Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel saved-trace-diagnostic'><div class='diagnostic-head'><h3>已保存明细</h3>"
                            "<span class='status-pill status-muted flash-badge'>Flash</span></div><div class='diagnostic-metric-grid'>");
    sendFmt("<div class='diagnostic-metric'><span>保存</span><strong>%s</strong></div>", savedCount);
    sendFmt("<div class='diagnostic-metric'><span>文件占用</span><strong>%s</strong></div>", savedSpace);
    if (savedReady) {
        sendFmt("</div><div class='diagnostic-foot'><span>单条最多 <b>%lu 点</b></span></div>",
                static_cast<unsigned long>(savedStats.sampleCapacityPerTrace));
    } else {
        Esp32BaseWeb::sendChunk("</div><div class='diagnostic-foot'><span>单条最多 <b>-</b></span></div>");
    }
    if (savedReady && savedStats.corrupt) {
        Esp32BaseWeb::sendChunk("<p class='err'>设备存储明细文件异常；不会影响启动和本次出水记录。</p>");
    }
    Esp32BaseWeb::sendChunk("</section>");
}

void sendSegmentedParameterPanel(const char* title,
                                 bool ready,
                                 bool applied,
                                 std::uint32_t overallPulsePerLiter,
                                 std::uint32_t startupDurationSec,
                                 std::uint32_t startupPulseCount,
                                 std::uint32_t startupVolumeMl,
                                 std::uint32_t startupPulsePerLiter,
                                 std::uint32_t stablePulsePerLiter,
                                 float pulsePerMl,
                                 std::uint32_t startupCompensationMl,
                                 std::uint32_t sampleCount,
                                 std::uint32_t minActualMl,
                                 std::uint32_t maxActualMl,
                                 std::uint32_t maxErrorMl) {
    char statusClass[16]{};
    std::snprintf(statusClass, sizeof(statusClass), "%s", ready ? (applied ? "status-ok" : "status-warn") : "status-muted");
    Esp32BaseWeb::sendChunk("<section class='panel calibration-param-panel'><div class='panel-head'><h3>");
    Esp32BaseWeb::sendChunk(title);
    sendFmt("</h3><span class='status-pill %s'>%s</span></div><table class='kv'>",
            statusClass,
            ready ? (applied ? "当前使用" : "待应用") : "未生成");
    if (!ready) {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td>暂无参数</td></tr></table></section>");
        return;
    }
    char startupVolume[24]{};
    char compensation[24]{};
    char rangeMin[24]{};
    char rangeMax[24]{};
    formatLiters(startupVolumeMl, startupVolume, sizeof(startupVolume));
    formatLiters(startupCompensationMl, compensation, sizeof(compensation));
    formatLiters(minActualMl, rangeMin, sizeof(rangeMin));
    formatLiters(maxActualMl, rangeMax, sizeof(rangeMax));
    sendFmt("<tr><th>控制 P/L</th><td>%luP/L</td></tr>"
            "<tr><th>启动补偿</th><td>%s</td></tr>"
            "<tr><th>稳态 P/L</th><td>%luP/L</td></tr>"
            "<tr><th>启动等效</th><td>%s / %lus / %luP / %luP/L</td></tr>"
            "<tr><th>全程平均</th><td>%luP/L</td></tr>",
            static_cast<unsigned long>(pulsePerLiterFromPulsePerMl(pulsePerMl)),
            compensation,
            static_cast<unsigned long>(stablePulsePerLiter),
            startupVolume,
            static_cast<unsigned long>(startupDurationSec),
            static_cast<unsigned long>(startupPulseCount),
            static_cast<unsigned long>(startupPulsePerLiter),
            static_cast<unsigned long>(overallPulsePerLiter));
    if (sampleCount > 0) {
        sendFmt("<tr><th>样本范围</th><td>%lu 条，%s-%s，最大误差 ±%luml</td></tr>",
                static_cast<unsigned long>(sampleCount),
                rangeMin,
                rangeMax,
                static_cast<unsigned long>(maxErrorMl));
    }
    Esp32BaseWeb::sendChunk("</table></section>");
}

void sendCalibrationParameterPanels() {
    const SystemConfig& config = *g_context.config;
    const std::uint32_t activeCompensation = startupCompensationFromSegmentedParams(
        config.startupVolumeMl, config.startupPulseCount, config.stablePulsePerLiter);
    const std::uint32_t candidateCompensation = startupCompensationFromSegmentedParams(
        config.candidateStartupVolumeMl, config.candidateStartupPulseCount, config.candidateStablePulsePerLiter);
    sendSegmentedParameterPanel("当前参数",
                                config.segmentedMeteringCalibrated,
                                true,
                                config.overallPulsePerLiter,
                                config.startupDurationSec,
                                config.startupPulseCount,
                                config.startupVolumeMl,
                                config.startupPulsePerLiter,
                                config.stablePulsePerLiter,
                                config.pulsePerMl,
                                config.startupCompensationMl,
                                0,
                                0,
                                0,
                                0);
    sendSegmentedParameterPanel("候选参数",
                                config.segmentedCandidateReady,
                                false,
                                config.candidateOverallPulsePerLiter,
                                config.candidateStartupDurationSec,
                                config.candidateStartupPulseCount,
                                config.candidateStartupVolumeMl,
                                config.candidateStartupPulsePerLiter,
                                config.candidateStablePulsePerLiter,
                                config.candidateStablePulsePerLiter > 0
                                    ? static_cast<float>(config.candidateStablePulsePerLiter) / 1000.0f
                                    : 0.0f,
                                candidateCompensation,
                                config.candidateSampleCount,
                                config.candidateMinActualMl,
                                config.candidateMaxActualMl,
                                config.candidateMaxErrorMl);
    sendSegmentedParameterPanel("上一套参数",
                                config.segmentedPreviousReady,
                                false,
                                config.previousOverallPulsePerLiter,
                                config.previousStartupDurationSec,
                                config.previousStartupPulseCount,
                                config.previousStartupVolumeMl,
                                config.previousStartupPulsePerLiter,
                                config.previousStablePulsePerLiter,
                                config.previousPulsePerMl,
                                config.previousStartupCompensationMl ? config.previousStartupCompensationMl : activeCompensation,
                                0,
                                0,
                                0,
                                0);
}

void sendCalibrationFormulaPanel() {
    Esp32BaseWeb::sendChunk("<section class='panel calibration-formula-panel'><h3>参数说明与计算公式</h3>"
                            "<table class='kv'>"
                            "<tr><th>控制 P/L</th><td>当前关阀和记录估算真正使用的脉冲系数；控制P/ml = 控制P/L ÷ 1000。</td></tr>"
                            "<tr><th>启动补偿</th><td>第一颗有效脉冲后追加到估算容量上的固定补偿，用来抵消启动爬坡阶段的少算水量。</td></tr>"
                            "<tr><th>实时估算</th><td><code>估算出水量 = round(脉冲数 / 控制P/ml) + 启动补偿</code>，无有效脉冲时为 0。</td></tr>"
                            "<tr><th>候选拟合</th><td><code>实测容量 ≈ 启动等效水量 + 稳态脉冲数 × 1000 / 稳态P/L</code>。</td></tr>"
                            "<tr><th>全程平均</th><td>全程平均只做长期诊断：取最大容量样本的总脉冲 ÷ 实测容量，用来和历史大容量实验对照，不直接控制关阀。</td></tr>"
                            "<tr><th>应用候选</th><td>应用后会把控制 P/L 设为候选稳态 P/L，并把启动等效折算成启动补偿；候选参数本身仍保留用于对比。</td></tr>"
                            "</table></section>");
}

